#include<stdio.h>
#include<string.h>
#include<stdlib.h>

int main(){
    int w,h,n, l,d,x,y;
    int darr[100][100]={0};
    float n1,n2;

    scanf("%d %d",&w,&h);
    scanf("%d",&n);

    for(int i=0;i<n;i++){
        scanf("%d %d %d %d",&l,&d,&x,&y);
        x -=1; y-=1;
        if(d==1){//막대가 가로인 경우
            for(int j=0;j<l;j++){//막대의 길이 만큼
                darr[x+j][y] = darr[x+j][y]==0?1:0;
                //(2,3)이면 3은 고정 x가 증가
            }
        }
        else if(d==0){
            for(int k=0;k<l;k++){
                darr[x][y+k] = darr[x][y+k]==0?1:0;
            }
        }
        /*
1 1 0 0 0 
0 0 1 0 1 
0 0 1 0 1 
0 0 1 0 1 
0 0 0 0 1 
*/
        
    }

    for(int i=0;i<w;i++){
        for(int j=0;j<h;j++) printf("%d ",darr[i][j]);
        printf("\n");
    }
/*


2 0 1 1
->막대길이:2 d방향:0(가로) 좌표(1,1)

3 1 2 3
->막대길이:3 방향:1(세로) 좌표(2,3)

4 1 2 5
->막대길이:4 방향:1(세로) 좌표(2,5)

d(방향): 가로는 0, 세로는 1
*/
   

    
} 
/*
5 5
3
2 0 1 1
3 1 2 3
4 1 2 5
5 5 
->격자판의 세로 5 가로 5
3
->줄에 놓을 수 있는 막대의 개수

2 0 1 1
->막대길이:2 방향:0(가로) 좌표(1,1)

3 1 2 3
->막대길이:3 방향:1(세로) 좌표(2,3)

4 1 2 5
->막대길이:4 방향:1(세로) 좌표(2,5)

d(방향): 가로는 0, 세로는 1
*/